Revit 2027 API
ParameterTypeId.RebarShapeName Property
 "Shape Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeName { get; }
Public Shared ReadOnly Property RebarShapeName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeName {
	ForgeTypeId^ get ();
}
static member RebarShapeName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace